---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.CustomField
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.CustomField

For this field type the value for each row is computed based on the (sub)elements that are grouped on that row
 and can have a graphic representation when the schedule is placed on a sheet.